# 작업 1유형

In [2]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
print(df.isnull().sum())

longitude               0
latitude                0
housing_median_age    323
total_rooms             0
total_bedrooms        207
population            950
households              0
median_income         234
median_house_value     44
ocean_proximity         0
dtype: int64

In [6]:
df = df.dropna().reset_index(drop = True)
df_filter = df.iloc[:int(len(df)*0.7)]
result = df_filter.median_income.quantile(0.25).round(2)
print(result)

2.51

In [7]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
df.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1968  2576068.3
1   Arab World          ARB  1969  2843420.4
2   Arab World          ARB  1970  3138550.0
3   Arab World          ARB  1971  3642691.0
4   Arab World          ARB  1972  4331605.7

In [20]:
v_1990 = df.loc[df.Year == 1990].Value.mean()
v_2010 = df.loc[df.Year == 2010].Value.mean()
print(v_1990)
print(v_2010)

df_1990 = df.loc[(df.Year == 1990) & (df.Value <= v_1990)]
df_2010 = df.loc[(df.Year == 2010) & (df.Value >= v_2010)]

result = len(set(df_1990['Country Code']) & set(df_2010['Country Code']))
print(result)

75508617.92792793
213833334.202
5

In [57]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
print(display(df.head()))
result = df.isnull().sum().sort_values().index[-1]
print(result)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,C123,S

None
Fare

# 제 2유형

In [80]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_train_.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_test_.csv')
print(display(train.head()))
# print(train.isnull().sum())
# print(train.info())
print(train.nunique())

drop_col1 = ['ID','TravelInsurance']
drop_col2 = ['ID']
train_drop = train.drop(columns = drop_col1)
test_drop = test.drop(columns = drop_col2)
y = train.TravelInsurance

train_dummies = pd.get_dummies(train_drop)
test_dummies = pd.get_dummies(test_drop)
test_dummies = test_dummies[train_dummies.columns]

from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

rf = RandomForestClassifier(random_state = 23)

x_t,x_v,y_t,y_v = train_test_split(train_dummies,y,stratify = y, test_size = 0.33, random_state=42)
rf.fit(x_t,y_t)

predict_train_proba = rf.predict_proba(x_t)[:,1]
predict_val_prob = rf.predict_proba(x_v)[:,1]
from sklearn.metrics import roc_auc_score

print(roc_auc_score(y_t,predict_train_proba))
print(roc_auc_score(y_v,predict_val_prob))

predict_test_proba = rf.predict_proba(test_dummies)[:,1]

result = pd.DataFrame({ 'ID' : test['ID'] , 'proba' : predict_test_proba})
print(display(result))

,ID,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,1008,26,Private Sector/Self Employed,Yes,1400000,5,0,No,Yes,1
1,199,30,Private Sector/Self Employed,No,1450000,5,0,Yes,Yes,1
2,86,32,Government Sector,Yes,900000,4,0,No,No,0
3,560,26,Private Sector/Self Employed,Yes,1400000,7,0,No,Yes,1
4,161,34,Private Sector/Self Employed,No,1400000,3,1,No,Yes,1

None
ID                     1490
Age                      11
Employment Type           2
GraduateOrNot             2
AnnualIncome             30
FamilyMembers             8
ChronicDiseases           2
FrequentFlyer             2
EverTravelledAbroad       2
TravelInsurance           2
dtype: int64
0.9900700934579438
0.7565209553853086

       ID     proba
0       6  0.013333
1       9  0.200000
2      20  0.126667
3      21  0.078833
4      23  0.040000
..    ...       ...
492  1964  0.242929
493  1970  0.478333
494  1973  1.000000
495  1976  0.800000
496  1982  1.000000

[497 rows x 2 columns]

None

# 제 3유형

In [21]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv')
df.head()

       ID     투약전     투약후
0  user_1  55.137  56.106
1  user_2  66.584  60.409
2  user_3  52.259  50.639
3  user_4  77.081  69.164
4  user_5  62.677  57.622

### 투약 후 체중에서 투약 전 체중을 뺏을 때 값은 일반 적으로 세가지 등급으로 나눈다.
### -3이하 : A등급, -3초과 0이하 : B등급, 0 초과 : C등급. 약 실험에서 A,B,C 그룹간의 인원 수 비율은 2:1:1로 알려져 있다.
### 위 데이터 표본은 각 범주의 비율에 적합한지 카이제곱 검정하려한다.

In [24]:
df['dels'] = df['투약후'] - df['투약전']

def groupby_filter(x) :
    if x <= -3 : 
        return 'A'
    elif x<= 0 :
        return 'B'
    else:
        return 'C'

df['groupby'] = df['dels'].apply(groupby_filter)
result = df.loc[df['groupby'] == 'A'].value_counts().sum()
print(result)

121

In [34]:
target = df['groupby'].value_counts().sort_index().to_frame()
target['expected'] = [target['groupby'].sum()*0.5, target['groupby'].sum()*0.25, target['groupby'].sum()*0.25]

from scipy.stats import chisquare
s,p = chisquare(target['groupby'],target['expected'])

print(s)
print(p)

round_s = round(s,3)
print(round_s)

round_p = round(p,3)
print(round_p)
print('귀무')

3.6127659574468085
0.1642471491200832
3.613
0.164
귀무

In [35]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2_.csv')
df.head()

     rpm group
0  163.6     A
1  246.9     A
2  234.9     A
3  156.9     A
4  226.6     A

In [41]:
from scipy.stats import shapiro

a = df[df['group'] =='A'].rpm
b = df[df['group'] == 'B'].rpm

a_s,a_p = shapiro(a)
b_s,b_p = shapiro(b)
print(a_p)
print(b_p)

from scipy.stats import levene
s , p = levene(a,b)
round_p = round(p,3)
print(round_p)

from scipy.stats import ttest_rel
s , p = ttest_rel(b,a,alternative = 'greater')
round_p = round(p,3)
print(round_p)
print('대립')

0.397915244102478
0.9562925100326538
0.904
0.009
대립